{"web_name": "NCU", "id": "NCU--E1", "ques": "Identify the courses available in the Department of Electrical Engineering.", "web": "https://www.ncu.edu.tw/tw/"}
{"web_name": "NCU", "id": "NCU--E2", "ques": "Locate and summarize the recent news related to university awards and achievements.", "web": "https://www.ncu.edu.tw/tw/"}
{"web_name": "NCU", "id": "NCU--E3", "ques": "Find the page that lists available research scholarships for international students and summarize the options.", "web": "https://www.ncu.edu.tw/tw/"}
{"web_name": "NCU", "id": "NCU--E4", "ques": "Find the contact information for the Office of International Affairs and list the available communication methods.", "web": "https://www.ncu.edu.tw/tw/"}
{"web_name": "NCU", "id": "NCU--E5", "ques": "Look up the current rankings of NCU in international university rankings, if available.", "web": "https://www.ncu.edu.tw/tw/"}
{"web_name": "Pchome24h", "id": "Pchome24h--E1", "ques": "Search for the latest offers on home appliances, specifically refrigerators, and list the top three deals.", "web": "https://24h.pchome.com.tw/"}
{"web_name": "Pchome24h", "id": "Pchome24h--E2", "ques": "Find the price of a Samsung Galaxy Tab S9 with at least 256GB storage and report the best price available.", "web": "https://24h.pchome.com.tw/"}
{"web_name": "Pchome24h", "id": "Pchome24h--E3", "ques": "Find the available models and prices for Bluetooth headphones from Sony and provide a summary.", "web": "https://24h.pchome.com.tw/"}
{"web_name": "Pchome24h", "id": "Pchome24h--E4", "ques": "Find if there are any promotional bundles for buying coffee makers and coffee beans together.", "web": "https://24h.pchome.com.tw/"}
{"web_name": "Pchome24h", "id": "Pchome24h--E5", "ques": "Identify any discounts or promotions on smartwatches from Garmin and list the best offers.", "web": "https://24h.pchome.com.tw/"}
{"web_name": "Threads", "id": "Threads--E1", "ques": "Search for the latest updates on space exploration and provide a summary of the top 5 posts you find.", "web": "https://threads.net"}
{"web_name": "Threads", "id": "Threads--E2", "ques": "Look up posts on Threads mentioning \"AI advancements\" and give a brief description of three posts with the highest engagement.", "web": "https://threads.net"}
{"web_name": "Threads", "id": "Threads--E3", "ques": "Find posts related to \"new music releases\" from this week and list three popular artists mentioned.", "web": "https://threads.net"}
{"web_name": "Threads", "id": "Threads--E4", "ques": "Find three recent posts about book recommendations and list the book titles and authors mentioned.", "web": "https://threads.net"}
{"web_name": "Threads", "id": "Threads--E5", "ques": "Find posts about career advice and list three unique tips shared in highly-engaged posts.", "web": "https://threads.net"}
{"web_name": "GoogleNews", "id": "GoogleNews--E1", "ques": "Find the latest news on advancements in renewable energy, especially focusing on solar and wind power. Summarize any recent developments discussed.", "web": "https://news.google.com/"}
{"web_name": "GoogleNews", "id": "GoogleNews--E2", "ques": "Find news on recent technological innovations in artificial intelligence and highlight any new breakthroughs announced this week.", "web": "https://news.google.com/"}
{"web_name": "GoogleNews", "id": "GoogleNews--E3", "ques": "Check if there are any travel advisories or alerts for international flights to Europe. Summarize the reasons for the advisory and the countries affected.", "web": "https://news.google.com/"}
{"web_name": "GoogleNews", "id": "GoogleNews--E4", "ques": "Search for the latest updates in cybersecurity. Identify if there have been any significant data breaches reported within the past week and which sectors were impacted.", "web": "https://news.google.com/"}
{"web_name": "GoogleNews", "id": "GoogleNews--E5", "ques": "Search for updates on Taiwan’s tech industry, especially in semiconductor manufacturing. Summarize any recent advancements or partnerships formed within the last week.", "web": "https://news.google.com/"}
{"web_name": "PTTNews", "id": "PTTNews--E1", "ques": "Identify discussions in the Technology section focusing on new tech product releases and list user opinions for and against the latest products mentioned.", "web": "https://www.pttweb.cc/newest/all"}
{"web_name": "PTTNews", "id": "PTTNews--E2", "ques": "Check the trending topics in the Finance section, focusing on user sentiments around Taiwan’s stock market performance. Summarize both optimistic and pessimistic viewpoints.", "web": "https://www.pttweb.cc/newest/all"}
{"web_name": "PTTNews", "id": "PTTNews--E3", "ques": "In the Entertainment section, find the most discussed movie release this week and categorize user comments into those that are positive and negative.", "web": "https://www.pttweb.cc/newest/all"}
{"web_name": "PTTNews", "id": "PTTNews--E4", "ques": "Identify discussions around popular restaurants in the Food section and count the number of comments recommending and advising against each one.", "web": "https://www.pttweb.cc/newest/all"}
{"web_name": "PTTNews", "id": "PTTNews--E5", "ques": "In the Travel section, identify current recommendations for weekend getaways and summarize both positive and negative feedback on each destination.", "web": "https://www.pttweb.cc/newest/all"}